sgl/logs/sgl-deepseek-r1-200.log
Tailing logs of job 38 on cluster 'benchmark'...
├── Waiting for task resources on 1 node.
└── Job started. Streaming logs... (Ctrl-C to exit log streaming; job will not be killed)
(task, pid=6385) Using Python 3.10.13 environment at: /home/ubuntu/miniconda3
(task, pid=6385) Audited 1 package in 41ms
(task, pid=6385) Waiting for sgl server to start...
(task, pid=6385) Waiting for sgl server to start...
(task, pid=6385) Waiting for sgl server to start...
[...]
(task, pid=6385) sgl server started
(task, pid=6385) benchmark_args=Namespace(backend='sglang-oai', base_url=None, host='0.0.0.0', port=None, dataset_name='random', dataset_path='', model=None, tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=2000, random_range_ratio=1.0, request_rate=10.0, max_concurrency=None, output_file=None, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_seperated=False, flush_cache=False, warmup_requests=1, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)
(task, pid=6385) Namespace(backend='sglang-oai', base_url=None, host='0.0.0.0', port=30000, dataset_name='random', dataset_path='', model='deepseek-ai/DeepSeek-R1', tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1000, random_output_len=2000, random_range_ratio=1.0, request_rate=10.0, max_concurrency=None, output_file=None, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_seperated=False, flush_cache=False, warmup_requests=1, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)
(task, pid=6385) 
(task, pid=6385) If you do not want to randomly sample from a dataset, please use --dataset-name random-ids.
(task, pid=6385) #Input tokens: 200000
(task, pid=6385) #Output tokens: 400000
(task, pid=6385) Starting warmup with 1 sequences...
(task, pid=6385) Warmup completed with 1 sequences. Starting main benchmark run...
(task, pid=6385) 
(task, pid=6385)   0%|          | 0/200 [00:00<?, ?it/s]
(task, pid=6385)   0%|          | 1/200 [06:22<21:08:02, 382.32s/it]
(task, pid=6385)   1%|          | 2/200 [06:23<8:42:21, 158.29s/it] 
(task, pid=6385)  30%|██▉       | 59/200 [06:24<07:36,  3.24s/it]  
(task, pid=6385)  48%|████▊     | 95/200 [06:24<03:00,  1.72s/it]
(task, pid=6385)  59%|█████▉    | 118/200 [06:24<01:39,  1.21s/it]
(task, pid=6385)  69%|██████▉   | 138/200 [06:24<00:54,  1.13it/s]
100%|██████████| 200/200 [06:24<00:00,  1.92s/it]
(task, pid=6385) 
(task, pid=6385) ============ Serving Benchmark Result ============
(task, pid=6385) Backend:                                 sglang-oai
(task, pid=6385) Traffic request rate:                    10.0      
(task, pid=6385) Max reqeuest concurrency:                not set   
(task, pid=6385) Successful requests:                     200       
(task, pid=6385) Benchmark duration (s):                  384.54    
(task, pid=6385) Total input tokens:                      200000    
(task, pid=6385) Total generated tokens:                  400000    
(task, pid=6385) Total generated tokens (retokenized):    398773    
(task, pid=6385) Request throughput (req/s):              0.52      
(task, pid=6385) Input token throughput (tok/s):          520.10    
(task, pid=6385) Output token throughput (tok/s):         1040.19   
(task, pid=6385) Total token throughput (tok/s):          1560.29   
(task, pid=6385) Concurrency:                             194.80    
(task, pid=6385) ----------------End-to-End Latency----------------
(task, pid=6385) Mean E2E Latency (ms):                   374539.73 
(task, pid=6385) Median E2E Latency (ms):                 374635.96 
(task, pid=6385) ---------------Time to First Token----------------
(task, pid=6385) Mean TTFT (ms):                          3117.98   
(task, pid=6385) Median TTFT (ms):                        1978.44   
(task, pid=6385) P99 TTFT (ms):                           9213.02   
(task, pid=6385) ---------------Inter-Token Latency----------------
(task, pid=6385) Mean ITL (ms):                           186.32    
(task, pid=6385) Median ITL (ms):                         178.87    
(task, pid=6385) P95 ITL (ms):                            349.62    
(task, pid=6385) P99 ITL (ms):                            357.74    
(task, pid=6385) Max ITL (ms):                            10864.93  
(task, pid=6385) ==================================================
(task, pid=6385) | Input Tokens | Output Tokens | Output Token Throughput (tok/s) |
(task, pid=6385) |1000 | 2000 | 1040.19 |
(task, pid=6385) benchmark_args=Namespace(backend='sglang-oai', base_url=None, host='0.0.0.0', port=None, dataset_name='random', dataset_path='', model=None, tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=5000, random_output_len=1000, random_range_ratio=1.0, request_rate=10.0, max_concurrency=None, output_file=None, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_seperated=False, flush_cache=False, warmup_requests=1, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)
(task, pid=6385) Namespace(backend='sglang-oai', base_url=None, host='0.0.0.0', port=30000, dataset_name='random', dataset_path='', model='deepseek-ai/DeepSeek-R1', tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=5000, random_output_len=1000, random_range_ratio=1.0, request_rate=10.0, max_concurrency=None, output_file=None, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_seperated=False, flush_cache=False, warmup_requests=1, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)
(task, pid=6385) 
(task, pid=6385) If you do not want to randomly sample from a dataset, please use --dataset-name random-ids.
(task, pid=6385) #Input tokens: 1000000
(task, pid=6385) #Output tokens: 200000
(task, pid=6385) Starting warmup with 1 sequences...
(task, pid=6385) Warmup completed with 1 sequences. Starting main benchmark run...
(task, pid=6385) 
(task, pid=6385)   0%|          | 0/200 [00:00<?, ?it/s]
(task, pid=6385)   0%|          | 1/200 [03:55<13:01:54, 235.75s/it]
(task, pid=6385)  13%|█▎        | 26/200 [03:57<18:47,  6.48s/it]   
 76%|███████▌  | 151/200 [03:57<00:40,  1.22it/s]
100%|██████████| 200/200 [03:57<00:00,  1.19s/it]
(task, pid=6385) 
(task, pid=6385) ============ Serving Benchmark Result ============
(task, pid=6385) Backend:                                 sglang-oai
(task, pid=6385) Traffic request rate:                    10.0      
(task, pid=6385) Max reqeuest concurrency:                not set   
(task, pid=6385) Successful requests:                     200       
(task, pid=6385) Benchmark duration (s):                  237.49    
(task, pid=6385) Total input tokens:                      1000000   
(task, pid=6385) Total generated tokens:                  200000    
(task, pid=6385) Total generated tokens (retokenized):    199408    
(task, pid=6385) Request throughput (req/s):              0.84      
(task, pid=6385) Input token throughput (tok/s):          4210.69   
(task, pid=6385) Output token throughput (tok/s):         842.14    
(task, pid=6385) Total token throughput (tok/s):          5052.83   
(task, pid=6385) Concurrency:                             191.59    
(task, pid=6385) ----------------End-to-End Latency----------------
(task, pid=6385) Mean E2E Latency (ms):                   227500.31 
(task, pid=6385) Median E2E Latency (ms):                 227658.17 
(task, pid=6385) ---------------Time to First Token----------------
(task, pid=6385) Mean TTFT (ms):                          20195.68  
(task, pid=6385) Median TTFT (ms):                        20080.46  
(task, pid=6385) P99 TTFT (ms):                           37087.86  
(task, pid=6385) ---------------Inter-Token Latency----------------
(task, pid=6385) Mean ITL (ms):                           208.00    
(task, pid=6385) Median ITL (ms):                         180.46    
(task, pid=6385) P95 ITL (ms):                            351.40    
(task, pid=6385) P99 ITL (ms):                            360.20    
(task, pid=6385) Max ITL (ms):                            53445.08  
(task, pid=6385) ==================================================
(task, pid=6385) | Input Tokens | Output Tokens | Output Token Throughput (tok/s) |
(task, pid=6385) |1000 | 2000 | 1040.19 |
(task, pid=6385) |5000 | 1000 | 842.14 |
(task, pid=6385) benchmark_args=Namespace(backend='sglang-oai', base_url=None, host='0.0.0.0', port=None, dataset_name='random', dataset_path='', model=None, tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=10000, random_output_len=500, random_range_ratio=1.0, request_rate=10.0, max_concurrency=None, output_file=None, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_seperated=False, flush_cache=False, warmup_requests=1, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)
(task, pid=6385) Namespace(backend='sglang-oai', base_url=None, host='0.0.0.0', port=30000, dataset_name='random', dataset_path='', model='deepseek-ai/DeepSeek-R1', tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=10000, random_output_len=500, random_range_ratio=1.0, request_rate=10.0, max_concurrency=None, output_file=None, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_seperated=False, flush_cache=False, warmup_requests=1, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)
(task, pid=6385) 
(task, pid=6385) If you do not want to randomly sample from a dataset, please use --dataset-name random-ids.
(task, pid=6385) #Input tokens: 2000000
(task, pid=6385) #Output tokens: 100000
(task, pid=6385) Starting warmup with 1 sequences...
(task, pid=6385) Warmup completed with 1 sequences. Starting main benchmark run...
(task, pid=6385) 
(task, pid=6385)   0%|          | 0/200 [00:00<?, ?it/s]
(task, pid=6385)   0%|          | 1/200 [03:38<12:03:39, 218.19s/it]
(task, pid=6385)  13%|█▎        | 26/200 [03:38<17:15,  5.95s/it]   
(task, pid=6385)  26%|██▌       | 51/200 [03:38<06:11,  2.49s/it]
100%|██████████| 200/200 [03:38<00:00,  1.09s/it]
(task, pid=6385) 
(task, pid=6385) ============ Serving Benchmark Result ============
(task, pid=6385) Backend:                                 sglang-oai
(task, pid=6385) Traffic request rate:                    10.0      
(task, pid=6385) Max reqeuest concurrency:                not set   
(task, pid=6385) Successful requests:                     200       
(task, pid=6385) Benchmark duration (s):                  218.63    
(task, pid=6385) Total input tokens:                      2000000   
(task, pid=6385) Total generated tokens:                  100000    
(task, pid=6385) Total generated tokens (retokenized):    99522     
(task, pid=6385) Request throughput (req/s):              0.91      
(task, pid=6385) Input token throughput (tok/s):          9147.90   
(task, pid=6385) Output token throughput (tok/s):         457.40    
(task, pid=6385) Total token throughput (tok/s):          9605.30   
(task, pid=6385) Concurrency:                             191.08    
(task, pid=6385) ----------------End-to-End Latency----------------
(task, pid=6385) Mean E2E Latency (ms):                   208881.90 
(task, pid=6385) Median E2E Latency (ms):                 208962.09 
(task, pid=6385) ---------------Time to First Token----------------
(task, pid=6385) Mean TTFT (ms):                          57888.00  
(task, pid=6385) Median TTFT (ms):                        56870.49  
(task, pid=6385) P99 TTFT (ms):                           108905.57 
(task, pid=6385) ---------------Inter-Token Latency----------------
(task, pid=6385) Mean ITL (ms):                           303.82    
(task, pid=6385) Median ITL (ms):                         183.32    
(task, pid=6385) P95 ITL (ms):                            357.90    
(task, pid=6385) P99 ITL (ms):                            365.52    
(task, pid=6385) Max ITL (ms):                            121282.35 
(task, pid=6385) ==================================================
(task, pid=6385) | Input Tokens | Output Tokens | Output Token Throughput (tok/s) |
(task, pid=6385) |1000 | 2000 | 1040.19 |
(task, pid=6385) |5000 | 1000 | 842.14 |
(task, pid=6385) |10000 | 500 | 457.40 |
(task, pid=6385) benchmark_args=Namespace(backend='sglang-oai', base_url=None, host='0.0.0.0', port=None, dataset_name='random', dataset_path='', model=None, tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=30000, random_output_len=100, random_range_ratio=1.0, request_rate=10.0, max_concurrency=None, output_file=None, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_seperated=False, flush_cache=False, warmup_requests=1, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)
(task, pid=6385) Namespace(backend='sglang-oai', base_url=None, host='0.0.0.0', port=30000, dataset_name='random', dataset_path='', model='deepseek-ai/DeepSeek-R1', tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=30000, random_output_len=100, random_range_ratio=1.0, request_rate=10.0, max_concurrency=None, output_file=None, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, lora_name=None, prompt_suffix='', pd_seperated=False, flush_cache=False, warmup_requests=1, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256)
(task, pid=6385) 
(task, pid=6385) If you do not want to randomly sample from a dataset, please use --dataset-name random-ids.
(task, pid=6385) #Input tokens: 6000000
(task, pid=6385) #Output tokens: 20000
(task, pid=6385) Starting warmup with 1 sequences...
(task, pid=6385) Warmup completed with 1 sequences. Starting main benchmark run...
(task, pid=6385) 
(task, pid=6385)   0%|          | 0/200 [00:00<?, ?it/s]
(task, pid=6385)   0%|          | 1/200 [03:06<10:18:50, 186.59s/it]
(task, pid=6385)   6%|▌         | 11/200 [03:06<38:31, 12.23s/it]   
(task, pid=6385)  36%|███▌      | 71/200 [03:07<02:56,  1.36s/it]
(task, pid=6385)  40%|████      | 80/200 [03:20<02:43,  1.36s/it]
(task, pid=6385)  40%|████      | 81/200 [06:12<08:39,  4.37s/it]
(task, pid=6385)  46%|████▌     | 91/200 [06:13<06:21,  3.50s/it]
(task, pid=6385)  76%|███████▌  | 151/200 [06:13<01:03,  1.30s/it]
(task, pid=6385)  80%|████████  | 160/200 [06:30<00:51,  1.30s/it]
(task, pid=6385)  80%|████████  | 161/200 [07:47<01:31,  2.36s/it]
 90%|█████████ | 181/200 [07:47<00:32,  1.72s/it]
100%|██████████| 200/200 [07:47<00:00,  2.34s/it]
(task, pid=6385) 
(task, pid=6385) ============ Serving Benchmark Result ============
(task, pid=6385) Backend:                                 sglang-oai
(task, pid=6385) Traffic request rate:                    10.0      
(task, pid=6385) Max reqeuest concurrency:                not set   
(task, pid=6385) Successful requests:                     200       
(task, pid=6385) Benchmark duration (s):                  467.78    
(task, pid=6385) Total input tokens:                      6000000   
(task, pid=6385) Total generated tokens:                  20000     
(task, pid=6385) Total generated tokens (retokenized):    19860     
(task, pid=6385) Request throughput (req/s):              0.43      
(task, pid=6385) Input token throughput (tok/s):          12826.64  
(task, pid=6385) Output token throughput (tok/s):         42.76     
(task, pid=6385) Total token throughput (tok/s):          12869.40  
(task, pid=6385) Concurrency:                             131.64    
(task, pid=6385) ----------------End-to-End Latency----------------
(task, pid=6385) Mean E2E Latency (ms):                   307881.19 
(task, pid=6385) Median E2E Latency (ms):                 358889.97 
(task, pid=6385) ---------------Time to First Token----------------
(task, pid=6385) Mean TTFT (ms):                          231602.19 
(task, pid=6385) Median TTFT (ms):                        231767.13 
(task, pid=6385) P99 TTFT (ms):                           444251.01 
(task, pid=6385) ---------------Inter-Token Latency----------------
(task, pid=6385) Mean ITL (ms):                           774.45    
(task, pid=6385) Median ITL (ms):                         54.13     
(task, pid=6385) P95 ITL (ms):                            56.84     
(task, pid=6385) P99 ITL (ms):                            588.08    
(task, pid=6385) Max ITL (ms):                            162949.24 
(task, pid=6385) ==================================================
(task, pid=6385) | Input Tokens | Output Tokens | Output Token Throughput (tok/s) |
(task, pid=6385) |1000 | 2000 | 1040.19 |
(task, pid=6385) |5000 | 1000 | 842.14 |
(task, pid=6385) |10000 | 500 | 457.40 |
(task, pid=6385) |30000 | 100 | 42.76 |
(task, pid=6385) Benchmark results for sgl on deepseek-ai/DeepSeek-R1:
(task, pid=6385) | Input Tokens | Output Tokens | Output Token Throughput (tok/s) |
(task, pid=6385) |1000 | 2000 | 1040.19 |
(task, pid=6385) |5000 | 1000 | 842.14 |
(task, pid=6385) |10000 | 500 | 457.40 |
(task, pid=6385) |30000 | 100 | 42.76 |
✓ Job finished (status: SUCCEEDED).